zephyrproject-rtos/hal_microchip/pic32c/pic32cxsg/include/pic32cxsg60/component/sdhc.h
/*
 * Component description for SDHC
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-03-17T09:48:46Z */
#ifndef _PIC32CXSG60_SDHC_COMPONENT_H_
#define _PIC32CXSG60_SDHC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SDHC                                         */
/* ************************************************************************** */

/* -------- SDHC_SSAR : (SDHC Offset: 0x00) (R/W 32) SDMA System Address / Argument 2 -------- */
#define SDHC_SSAR_RESETVALUE                  _UINT32_(0x00)                                       /*  (SDHC_SSAR) SDMA System Address / Argument 2  Reset Value */

#define SDHC_SSAR_ADDR_Pos                    _UINT32_(0)                                          /* (SDHC_SSAR) SDMA System Address Position */
#define SDHC_SSAR_ADDR_Msk                    (_UINT32_(0xFFFFFFFF) << SDHC_SSAR_ADDR_Pos)         /* (SDHC_SSAR) SDMA System Address Mask */
#define SDHC_SSAR_ADDR(value)                 (SDHC_SSAR_ADDR_Msk & (_UINT32_(value) << SDHC_SSAR_ADDR_Pos)) /* Assigment of value for ADDR in the SDHC_SSAR register */
#define SDHC_SSAR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (SDHC_SSAR) Register Mask  */

/* CMD23 mode */
#define SDHC_SSAR_CMD23_ARG2_Pos              _UINT32_(0)                                          /* (SDHC_SSAR) Argument 2 Position */
#define SDHC_SSAR_CMD23_ARG2_Msk              (_UINT32_(0xFFFFFFFF) << SDHC_SSAR_CMD23_ARG2_Pos)   /* (SDHC_SSAR) Argument 2 Mask */
#define SDHC_SSAR_CMD23_ARG2(value)           (SDHC_SSAR_CMD23_ARG2_Msk & (_UINT32_(value) << SDHC_SSAR_CMD23_ARG2_Pos))
#define SDHC_SSAR_CMD23_Msk                   _UINT32_(0xFFFFFFFF)                                  /* (SDHC_SSAR_CMD23) Register Mask  */


/* -------- SDHC_BSR : (SDHC Offset: 0x04) (R/W 16) Block Size -------- */
#define SDHC_BSR_RESETVALUE                   _UINT16_(0x00)                                       /*  (SDHC_BSR) Block Size  Reset Value */

#define SDHC_BSR_BLOCKSIZE_Pos                _UINT16_(0)                                          /* (SDHC_BSR) Transfer Block Size Position */
#define SDHC_BSR_BLOCKSIZE_Msk                (_UINT16_(0x3FF) << SDHC_BSR_BLOCKSIZE_Pos)          /* (SDHC_BSR) Transfer Block Size Mask */
#define SDHC_BSR_BLOCKSIZE(value)             (SDHC_BSR_BLOCKSIZE_Msk & (_UINT16_(value) << SDHC_BSR_BLOCKSIZE_Pos)) /* Assigment of value for BLOCKSIZE in the SDHC_BSR register */
#define SDHC_BSR_BOUNDARY_Pos                 _UINT16_(12)                                         /* (SDHC_BSR) SDMA Buffer Boundary Position */
#define SDHC_BSR_BOUNDARY_Msk                 (_UINT16_(0x7) << SDHC_BSR_BOUNDARY_Pos)             /* (SDHC_BSR) SDMA Buffer Boundary Mask */
#define SDHC_BSR_BOUNDARY(value)              (SDHC_BSR_BOUNDARY_Msk & (_UINT16_(value) << SDHC_BSR_BOUNDARY_Pos)) /* Assigment of value for BOUNDARY in the SDHC_BSR register */
#define   SDHC_BSR_BOUNDARY_4K_Val            _UINT16_(0x0)                                        /* (SDHC_BSR) 4k bytes  */
#define   SDHC_BSR_BOUNDARY_8K_Val            _UINT16_(0x1)                                        /* (SDHC_BSR) 8k bytes  */
#define   SDHC_BSR_BOUNDARY_16K_Val           _UINT16_(0x2)                                        /* (SDHC_BSR) 16k bytes  */
#define   SDHC_BSR_BOUNDARY_32K_Val           _UINT16_(0x3)                                        /* (SDHC_BSR) 32k bytes  */
#define   SDHC_BSR_BOUNDARY_64K_Val           _UINT16_(0x4)                                        /* (SDHC_BSR) 64k bytes  */
#define   SDHC_BSR_BOUNDARY_128K_Val          _UINT16_(0x5)                                        /* (SDHC_BSR) 128k bytes  */
#define   SDHC_BSR_BOUNDARY_256K_Val          _UINT16_(0x6)                                        /* (SDHC_BSR) 256k bytes  */
#define   SDHC_BSR_BOUNDARY_512K_Val          _UINT16_(0x7)                                        /* (SDHC_BSR) 512k bytes  */
#define SDHC_BSR_BOUNDARY_4K                  (SDHC_BSR_BOUNDARY_4K_Val << SDHC_BSR_BOUNDARY_Pos)  /* (SDHC_BSR) 4k bytes Position  */
#define SDHC_BSR_BOUNDARY_8K                  (SDHC_BSR_BOUNDARY_8K_Val << SDHC_BSR_BOUNDARY_Pos)  /* (SDHC_BSR) 8k bytes Position  */
#define SDHC_BSR_BOUNDARY_16K                 (SDHC_BSR_BOUNDARY_16K_Val << SDHC_BSR_BOUNDARY_Pos) /* (SDHC_BSR) 16k bytes Position  */
#define SDHC_BSR_BOUNDARY_32K                 (SDHC_BSR_BOUNDARY_32K_Val << SDHC_BSR_BOUNDARY_Pos) /* (SDHC_BSR) 32k bytes Position  */
#define SDHC_BSR_BOUNDARY_64K                 (SDHC_BSR_BOUNDARY_64K_Val << SDHC_BSR_BOUNDARY_Pos) /* (SDHC_BSR) 64k bytes Position  */
#define SDHC_BSR_BOUNDARY_128K                (SDHC_BSR_BOUNDARY_128K_Val << SDHC_BSR_BOUNDARY_Pos) /* (SDHC_BSR) 128k bytes Position  */
#define SDHC_BSR_BOUNDARY_256K                (SDHC_BSR_BOUNDARY_256K_Val << SDHC_BSR_BOUNDARY_Pos) /* (SDHC_BSR) 256k bytes Position  */
#define SDHC_BSR_BOUNDARY_512K                (SDHC_BSR_BOUNDARY_512K_Val << SDHC_BSR_BOUNDARY_Pos) /* (SDHC_BSR) 512k bytes Position  */
#define SDHC_BSR_Msk                          _UINT16_(0x73FF)                                     /* (SDHC_BSR) Register Mask  */


/* -------- SDHC_BCR : (SDHC Offset: 0x06) (R/W 16) Block Count -------- */
#define SDHC_BCR_RESETVALUE                   _UINT16_(0x00)                                       /*  (SDHC_BCR) Block Count  Reset Value */

#define SDHC_BCR_BCNT_Pos                     _UINT16_(0)                                          /* (SDHC_BCR) Blocks Count for Current Transfer Position */
#define SDHC_BCR_BCNT_Msk                     (_UINT16_(0xFFFF) << SDHC_BCR_BCNT_Pos)              /* (SDHC_BCR) Blocks Count for Current Transfer Mask */
#define SDHC_BCR_BCNT(value)                  (SDHC_BCR_BCNT_Msk & (_UINT16_(value) << SDHC_BCR_BCNT_Pos)) /* Assigment of value for BCNT in the SDHC_BCR register */
#define SDHC_BCR_Msk                          _UINT16_(0xFFFF)                                     /* (SDHC_BCR) Register Mask  */


/* -------- SDHC_ARG1R : (SDHC Offset: 0x08) (R/W 32) Argument 1 -------- */
#define SDHC_ARG1R_RESETVALUE                 _UINT32_(0x00)                                       /*  (SDHC_ARG1R) Argument 1  Reset Value */

#define SDHC_ARG1R_ARG_Pos                    _UINT32_(0)                                          /* (SDHC_ARG1R) Argument 1 Position */
#define SDHC_ARG1R_ARG_Msk                    (_UINT32_(0xFFFFFFFF) << SDHC_ARG1R_ARG_Pos)         /* (SDHC_ARG1R) Argument 1 Mask */
#define SDHC_ARG1R_ARG(value)                 (SDHC_ARG1R_ARG_Msk & (_UINT32_(value) << SDHC_ARG1R_ARG_Pos)) /* Assigment of value for ARG in the SDHC_ARG1R register */
#define SDHC_ARG1R_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (SDHC_ARG1R) Register Mask  */


