zephyrproject-rtos/hal_microchip/pic32c/pic32cxsg/include/pic32cxsg60/component/sdhc.h
/* -------- SDHC_CCR : (SDHC Offset: 0x2C) (R/W 16) Clock Control -------- */
#define SDHC_CCR_RESETVALUE                   _UINT16_(0x00)                                       /*  (SDHC_CCR) Clock Control  Reset Value */

#define SDHC_CCR_INTCLKEN_Pos                 _UINT16_(0)                                          /* (SDHC_CCR) Internal Clock Enable Position */
#define SDHC_CCR_INTCLKEN_Msk                 (_UINT16_(0x1) << SDHC_CCR_INTCLKEN_Pos)             /* (SDHC_CCR) Internal Clock Enable Mask */
#define SDHC_CCR_INTCLKEN(value)              (SDHC_CCR_INTCLKEN_Msk & (_UINT16_(value) << SDHC_CCR_INTCLKEN_Pos)) /* Assigment of value for INTCLKEN in the SDHC_CCR register */
#define   SDHC_CCR_INTCLKEN_OFF_Val           _UINT16_(0x0)                                        /* (SDHC_CCR) Stop  */
#define   SDHC_CCR_INTCLKEN_ON_Val            _UINT16_(0x1)                                        /* (SDHC_CCR) Oscillate  */
#define SDHC_CCR_INTCLKEN_OFF                 (SDHC_CCR_INTCLKEN_OFF_Val << SDHC_CCR_INTCLKEN_Pos) /* (SDHC_CCR) Stop Position  */
#define SDHC_CCR_INTCLKEN_ON                  (SDHC_CCR_INTCLKEN_ON_Val << SDHC_CCR_INTCLKEN_Pos)  /* (SDHC_CCR) Oscillate Position  */
#define SDHC_CCR_INTCLKS_Pos                  _UINT16_(1)                                          /* (SDHC_CCR) Internal Clock Stable Position */
#define SDHC_CCR_INTCLKS_Msk                  (_UINT16_(0x1) << SDHC_CCR_INTCLKS_Pos)              /* (SDHC_CCR) Internal Clock Stable Mask */
#define SDHC_CCR_INTCLKS(value)               (SDHC_CCR_INTCLKS_Msk & (_UINT16_(value) << SDHC_CCR_INTCLKS_Pos)) /* Assigment of value for INTCLKS in the SDHC_CCR register */
#define   SDHC_CCR_INTCLKS_NOT_READY_Val      _UINT16_(0x0)                                        /* (SDHC_CCR) Not Ready  */
#define   SDHC_CCR_INTCLKS_READY_Val          _UINT16_(0x1)                                        /* (SDHC_CCR) Ready  */
#define SDHC_CCR_INTCLKS_NOT_READY            (SDHC_CCR_INTCLKS_NOT_READY_Val << SDHC_CCR_INTCLKS_Pos) /* (SDHC_CCR) Not Ready Position  */
#define SDHC_CCR_INTCLKS_READY                (SDHC_CCR_INTCLKS_READY_Val << SDHC_CCR_INTCLKS_Pos) /* (SDHC_CCR) Ready Position  */
#define SDHC_CCR_SDCLKEN_Pos                  _UINT16_(2)                                          /* (SDHC_CCR) SD Clock Enable Position */
#define SDHC_CCR_SDCLKEN_Msk                  (_UINT16_(0x1) << SDHC_CCR_SDCLKEN_Pos)              /* (SDHC_CCR) SD Clock Enable Mask */
#define SDHC_CCR_SDCLKEN(value)               (SDHC_CCR_SDCLKEN_Msk & (_UINT16_(value) << SDHC_CCR_SDCLKEN_Pos)) /* Assigment of value for SDCLKEN in the SDHC_CCR register */
#define   SDHC_CCR_SDCLKEN_DISABLE_Val        _UINT16_(0x0)                                        /* (SDHC_CCR) Disable  */
#define   SDHC_CCR_SDCLKEN_ENABLE_Val         _UINT16_(0x1)                                        /* (SDHC_CCR) Enable  */
#define SDHC_CCR_SDCLKEN_DISABLE              (SDHC_CCR_SDCLKEN_DISABLE_Val << SDHC_CCR_SDCLKEN_Pos) /* (SDHC_CCR) Disable Position  */
#define SDHC_CCR_SDCLKEN_ENABLE               (SDHC_CCR_SDCLKEN_ENABLE_Val << SDHC_CCR_SDCLKEN_Pos) /* (SDHC_CCR) Enable Position  */
#define SDHC_CCR_CLKGSEL_Pos                  _UINT16_(5)                                          /* (SDHC_CCR) Clock Generator Select Position */
#define SDHC_CCR_CLKGSEL_Msk                  (_UINT16_(0x1) << SDHC_CCR_CLKGSEL_Pos)              /* (SDHC_CCR) Clock Generator Select Mask */
#define SDHC_CCR_CLKGSEL(value)               (SDHC_CCR_CLKGSEL_Msk & (_UINT16_(value) << SDHC_CCR_CLKGSEL_Pos)) /* Assigment of value for CLKGSEL in the SDHC_CCR register */
#define   SDHC_CCR_CLKGSEL_DIV_Val            _UINT16_(0x0)                                        /* (SDHC_CCR) Divided Clock Mode  */
#define   SDHC_CCR_CLKGSEL_PROG_Val           _UINT16_(0x1)                                        /* (SDHC_CCR) Programmable Clock Mode  */
#define SDHC_CCR_CLKGSEL_DIV                  (SDHC_CCR_CLKGSEL_DIV_Val << SDHC_CCR_CLKGSEL_Pos)   /* (SDHC_CCR) Divided Clock Mode Position  */
#define SDHC_CCR_CLKGSEL_PROG                 (SDHC_CCR_CLKGSEL_PROG_Val << SDHC_CCR_CLKGSEL_Pos)  /* (SDHC_CCR) Programmable Clock Mode Position  */
#define SDHC_CCR_USDCLKFSEL_Pos               _UINT16_(6)                                          /* (SDHC_CCR) Upper Bits of SDCLK Frequency Select Position */
#define SDHC_CCR_USDCLKFSEL_Msk               (_UINT16_(0x3) << SDHC_CCR_USDCLKFSEL_Pos)           /* (SDHC_CCR) Upper Bits of SDCLK Frequency Select Mask */
#define SDHC_CCR_USDCLKFSEL(value)            (SDHC_CCR_USDCLKFSEL_Msk & (_UINT16_(value) << SDHC_CCR_USDCLKFSEL_Pos)) /* Assigment of value for USDCLKFSEL in the SDHC_CCR register */
#define SDHC_CCR_SDCLKFSEL_Pos                _UINT16_(8)                                          /* (SDHC_CCR) SDCLK Frequency Select Position */
#define SDHC_CCR_SDCLKFSEL_Msk                (_UINT16_(0xFF) << SDHC_CCR_SDCLKFSEL_Pos)           /* (SDHC_CCR) SDCLK Frequency Select Mask */
#define SDHC_CCR_SDCLKFSEL(value)             (SDHC_CCR_SDCLKFSEL_Msk & (_UINT16_(value) << SDHC_CCR_SDCLKFSEL_Pos)) /* Assigment of value for SDCLKFSEL in the SDHC_CCR register */
#define SDHC_CCR_Msk                          _UINT16_(0xFFE7)                                     /* (SDHC_CCR) Register Mask  */


/* -------- SDHC_TCR : (SDHC Offset: 0x2E) (R/W 8) Timeout Control -------- */
#define SDHC_TCR_RESETVALUE                   _UINT8_(0x00)                                        /*  (SDHC_TCR) Timeout Control  Reset Value */

#define SDHC_TCR_DTCVAL_Pos                   _UINT8_(0)                                           /* (SDHC_TCR) Data Timeout Counter Value Position */
#define SDHC_TCR_DTCVAL_Msk                   (_UINT8_(0xF) << SDHC_TCR_DTCVAL_Pos)                /* (SDHC_TCR) Data Timeout Counter Value Mask */
#define SDHC_TCR_DTCVAL(value)                (SDHC_TCR_DTCVAL_Msk & (_UINT8_(value) << SDHC_TCR_DTCVAL_Pos)) /* Assigment of value for DTCVAL in the SDHC_TCR register */
#define SDHC_TCR_Msk                          _UINT8_(0x0F)                                        /* (SDHC_TCR) Register Mask  */


/* -------- SDHC_SRR : (SDHC Offset: 0x2F) (R/W 8) Software Reset -------- */
#define SDHC_SRR_RESETVALUE                   _UINT8_(0x00)                                        /*  (SDHC_SRR) Software Reset  Reset Value */

#define SDHC_SRR_SWRSTALL_Pos                 _UINT8_(0)                                           /* (SDHC_SRR) Software Reset For All Position */
#define SDHC_SRR_SWRSTALL_Msk                 (_UINT8_(0x1) << SDHC_SRR_SWRSTALL_Pos)              /* (SDHC_SRR) Software Reset For All Mask */
#define SDHC_SRR_SWRSTALL(value)              (SDHC_SRR_SWRSTALL_Msk & (_UINT8_(value) << SDHC_SRR_SWRSTALL_Pos)) /* Assigment of value for SWRSTALL in the SDHC_SRR register */
#define   SDHC_SRR_SWRSTALL_WORK_Val          _UINT8_(0x0)                                         /* (SDHC_SRR) Work  */
#define   SDHC_SRR_SWRSTALL_RESET_Val         _UINT8_(0x1)                                         /* (SDHC_SRR) Reset  */
#define SDHC_SRR_SWRSTALL_WORK                (SDHC_SRR_SWRSTALL_WORK_Val << SDHC_SRR_SWRSTALL_Pos) /* (SDHC_SRR) Work Position  */
#define SDHC_SRR_SWRSTALL_RESET               (SDHC_SRR_SWRSTALL_RESET_Val << SDHC_SRR_SWRSTALL_Pos) /* (SDHC_SRR) Reset Position  */
#define SDHC_SRR_SWRSTCMD_Pos                 _UINT8_(1)                                           /* (SDHC_SRR) Software Reset For CMD Line Position */
#define SDHC_SRR_SWRSTCMD_Msk                 (_UINT8_(0x1) << SDHC_SRR_SWRSTCMD_Pos)              /* (SDHC_SRR) Software Reset For CMD Line Mask */
#define SDHC_SRR_SWRSTCMD(value)              (SDHC_SRR_SWRSTCMD_Msk & (_UINT8_(value) << SDHC_SRR_SWRSTCMD_Pos)) /* Assigment of value for SWRSTCMD in the SDHC_SRR register */
#define   SDHC_SRR_SWRSTCMD_WORK_Val          _UINT8_(0x0)                                         /* (SDHC_SRR) Work  */
#define   SDHC_SRR_SWRSTCMD_RESET_Val         _UINT8_(0x1)                                         /* (SDHC_SRR) Reset  */
#define SDHC_SRR_SWRSTCMD_WORK                (SDHC_SRR_SWRSTCMD_WORK_Val << SDHC_SRR_SWRSTCMD_Pos) /* (SDHC_SRR) Work Position  */
#define SDHC_SRR_SWRSTCMD_RESET               (SDHC_SRR_SWRSTCMD_RESET_Val << SDHC_SRR_SWRSTCMD_Pos) /* (SDHC_SRR) Reset Position  */
#define SDHC_SRR_SWRSTDAT_Pos                 _UINT8_(2)                                           /* (SDHC_SRR) Software Reset For DAT Line Position */
#define SDHC_SRR_SWRSTDAT_Msk                 (_UINT8_(0x1) << SDHC_SRR_SWRSTDAT_Pos)              /* (SDHC_SRR) Software Reset For DAT Line Mask */
#define SDHC_SRR_SWRSTDAT(value)              (SDHC_SRR_SWRSTDAT_Msk & (_UINT8_(value) << SDHC_SRR_SWRSTDAT_Pos)) /* Assigment of value for SWRSTDAT in the SDHC_SRR register */
#define   SDHC_SRR_SWRSTDAT_WORK_Val          _UINT8_(0x0)                                         /* (SDHC_SRR) Work  */
#define   SDHC_SRR_SWRSTDAT_RESET_Val         _UINT8_(0x1)                                         /* (SDHC_SRR) Reset  */
#define SDHC_SRR_SWRSTDAT_WORK                (SDHC_SRR_SWRSTDAT_WORK_Val << SDHC_SRR_SWRSTDAT_Pos) /* (SDHC_SRR) Work Position  */
#define SDHC_SRR_SWRSTDAT_RESET               (SDHC_SRR_SWRSTDAT_RESET_Val << SDHC_SRR_SWRSTDAT_Pos) /* (SDHC_SRR) Reset Position  */
#define SDHC_SRR_Msk                          _UINT8_(0x07)                                        /* (SDHC_SRR) Register Mask  */


