zephyrproject-rtos/hal_microchip/pic32c/pic32cxsg/include/pic32cxsg60/component/sdhc.h
/* -------- SDHC_HCVR : (SDHC Offset: 0xFE) ( R/ 16) Host Controller Version -------- */
#define SDHC_HCVR_RESETVALUE                  _UINT16_(0x1802)                                     /*  (SDHC_HCVR) Host Controller Version  Reset Value */

#define SDHC_HCVR_SVER_Pos                    _UINT16_(0)                                          /* (SDHC_HCVR) Spec Version Position */
#define SDHC_HCVR_SVER_Msk                    (_UINT16_(0xFF) << SDHC_HCVR_SVER_Pos)               /* (SDHC_HCVR) Spec Version Mask */
#define SDHC_HCVR_SVER(value)                 (SDHC_HCVR_SVER_Msk & (_UINT16_(value) << SDHC_HCVR_SVER_Pos)) /* Assigment of value for SVER in the SDHC_HCVR register */
#define SDHC_HCVR_VVER_Pos                    _UINT16_(8)                                          /* (SDHC_HCVR) Vendor Version Position */
#define SDHC_HCVR_VVER_Msk                    (_UINT16_(0xFF) << SDHC_HCVR_VVER_Pos)               /* (SDHC_HCVR) Vendor Version Mask */
#define SDHC_HCVR_VVER(value)                 (SDHC_HCVR_VVER_Msk & (_UINT16_(value) << SDHC_HCVR_VVER_Pos)) /* Assigment of value for VVER in the SDHC_HCVR register */
#define SDHC_HCVR_Msk                         _UINT16_(0xFFFF)                                     /* (SDHC_HCVR) Register Mask  */


/* -------- SDHC_APSR : (SDHC Offset: 0x200) ( R/ 32) Additional Present State Register -------- */
#define SDHC_APSR_RESETVALUE                  _UINT32_(0x0F)                                       /*  (SDHC_APSR) Additional Present State Register  Reset Value */

#define SDHC_APSR_HDATLL_Pos                  _UINT32_(0)                                          /* (SDHC_APSR) High Line Level Position */
#define SDHC_APSR_HDATLL_Msk                  (_UINT32_(0xF) << SDHC_APSR_HDATLL_Pos)              /* (SDHC_APSR) High Line Level Mask */
#define SDHC_APSR_HDATLL(value)               (SDHC_APSR_HDATLL_Msk & (_UINT32_(value) << SDHC_APSR_HDATLL_Pos)) /* Assigment of value for HDATLL in the SDHC_APSR register */
#define SDHC_APSR_Msk                         _UINT32_(0x0000000F)                                 /* (SDHC_APSR) Register Mask  */


/* -------- SDHC_MC1R : (SDHC Offset: 0x204) (R/W 8) MMC Control 1 -------- */
#define SDHC_MC1R_RESETVALUE                  _UINT8_(0x00)                                        /*  (SDHC_MC1R) MMC Control 1  Reset Value */

#define SDHC_MC1R_CMDTYP_Pos                  _UINT8_(0)                                           /* (SDHC_MC1R) e.MMC Command Type Position */
#define SDHC_MC1R_CMDTYP_Msk                  (_UINT8_(0x3) << SDHC_MC1R_CMDTYP_Pos)               /* (SDHC_MC1R) e.MMC Command Type Mask */
#define SDHC_MC1R_CMDTYP(value)               (SDHC_MC1R_CMDTYP_Msk & (_UINT8_(value) << SDHC_MC1R_CMDTYP_Pos)) /* Assigment of value for CMDTYP in the SDHC_MC1R register */
#define   SDHC_MC1R_CMDTYP_NORMAL_Val         _UINT8_(0x0)                                         /* (SDHC_MC1R) Not a MMC specific command  */
#define   SDHC_MC1R_CMDTYP_WAITIRQ_Val        _UINT8_(0x1)                                         /* (SDHC_MC1R) Wait IRQ Command  */
#define   SDHC_MC1R_CMDTYP_STREAM_Val         _UINT8_(0x2)                                         /* (SDHC_MC1R) Stream Command  */
#define   SDHC_MC1R_CMDTYP_BOOT_Val           _UINT8_(0x3)                                         /* (SDHC_MC1R) Boot Command  */
#define SDHC_MC1R_CMDTYP_NORMAL               (SDHC_MC1R_CMDTYP_NORMAL_Val << SDHC_MC1R_CMDTYP_Pos) /* (SDHC_MC1R) Not a MMC specific command Position  */
#define SDHC_MC1R_CMDTYP_WAITIRQ              (SDHC_MC1R_CMDTYP_WAITIRQ_Val << SDHC_MC1R_CMDTYP_Pos) /* (SDHC_MC1R) Wait IRQ Command Position  */
#define SDHC_MC1R_CMDTYP_STREAM               (SDHC_MC1R_CMDTYP_STREAM_Val << SDHC_MC1R_CMDTYP_Pos) /* (SDHC_MC1R) Stream Command Position  */
#define SDHC_MC1R_CMDTYP_BOOT                 (SDHC_MC1R_CMDTYP_BOOT_Val << SDHC_MC1R_CMDTYP_Pos)  /* (SDHC_MC1R) Boot Command Position  */
#define SDHC_MC1R_DDR_Pos                     _UINT8_(3)                                           /* (SDHC_MC1R) e.MMC HSDDR Mode Position */
#define SDHC_MC1R_DDR_Msk                     (_UINT8_(0x1) << SDHC_MC1R_DDR_Pos)                  /* (SDHC_MC1R) e.MMC HSDDR Mode Mask */
#define SDHC_MC1R_DDR(value)                  (SDHC_MC1R_DDR_Msk & (_UINT8_(value) << SDHC_MC1R_DDR_Pos)) /* Assigment of value for DDR in the SDHC_MC1R register */
#define SDHC_MC1R_OPD_Pos                     _UINT8_(4)                                           /* (SDHC_MC1R) e.MMC Open Drain Mode Position */
#define SDHC_MC1R_OPD_Msk                     (_UINT8_(0x1) << SDHC_MC1R_OPD_Pos)                  /* (SDHC_MC1R) e.MMC Open Drain Mode Mask */
#define SDHC_MC1R_OPD(value)                  (SDHC_MC1R_OPD_Msk & (_UINT8_(value) << SDHC_MC1R_OPD_Pos)) /* Assigment of value for OPD in the SDHC_MC1R register */
#define SDHC_MC1R_BOOTA_Pos                   _UINT8_(5)                                           /* (SDHC_MC1R) e.MMC Boot Acknowledge Enable Position */
#define SDHC_MC1R_BOOTA_Msk                   (_UINT8_(0x1) << SDHC_MC1R_BOOTA_Pos)                /* (SDHC_MC1R) e.MMC Boot Acknowledge Enable Mask */
#define SDHC_MC1R_BOOTA(value)                (SDHC_MC1R_BOOTA_Msk & (_UINT8_(value) << SDHC_MC1R_BOOTA_Pos)) /* Assigment of value for BOOTA in the SDHC_MC1R register */
#define SDHC_MC1R_RSTN_Pos                    _UINT8_(6)                                           /* (SDHC_MC1R) e.MMC Reset Signal Position */
#define SDHC_MC1R_RSTN_Msk                    (_UINT8_(0x1) << SDHC_MC1R_RSTN_Pos)                 /* (SDHC_MC1R) e.MMC Reset Signal Mask */
#define SDHC_MC1R_RSTN(value)                 (SDHC_MC1R_RSTN_Msk & (_UINT8_(value) << SDHC_MC1R_RSTN_Pos)) /* Assigment of value for RSTN in the SDHC_MC1R register */
#define SDHC_MC1R_FCD_Pos                     _UINT8_(7)                                           /* (SDHC_MC1R) e.MMC Force Card Detect Position */
#define SDHC_MC1R_FCD_Msk                     (_UINT8_(0x1) << SDHC_MC1R_FCD_Pos)                  /* (SDHC_MC1R) e.MMC Force Card Detect Mask */
#define SDHC_MC1R_FCD(value)                  (SDHC_MC1R_FCD_Msk & (_UINT8_(value) << SDHC_MC1R_FCD_Pos)) /* Assigment of value for FCD in the SDHC_MC1R register */
#define SDHC_MC1R_Msk                         _UINT8_(0xFB)                                        /* (SDHC_MC1R) Register Mask  */


